public class Task_6 {
    /*
    Напишите программу вывода всех четных чисел от 2 до 100 включительно
     */
    public static void main(String[] args) {
        for (int i = 2; i <= 100; i += 2) {
            System.out.print(i + " ");
        }
    }
}
